titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [3]:
import pandas as pd
import numpy as np
file_name = "train"
df_titanic = pd.read_csv(f"{file_name}.csv")

In [14]:
display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [149]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [53]:
 #ölenlerin indislerini degişkene attım
selection=df_titanic.Survived==0 
 #degişkenimdeki indisleri dataya vererek istediğim verileri alarak yaş sütünün ortalamasını buldum.
df_titanic[selection].Age.mean()

29.69911764705882

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [50]:
#ölen kişilerin indisleri elimdeydi ücret sütünunun ortalamasını buldum.
df_titanic[selection].Fare.mean() #ortalama

32.204207968574636

In [189]:
#ölen kişilerin indisleri elimdeydi ücret sütünunun medyanını buldum.
df_titanic[selection].Fare.median() #medyanı

27.0

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [74]:
#sorgulama yaparak da indisleri bulup istediğimiz verileri elde ederek gerekli sutuna ortalama işlemlerini gerçekleştirdim.
df_titanic.query("Survived==0 and Sex=='male'").Age.mean()

30.72664459161148

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [75]:
#sorgulama yaparak da indisleri bulup istediğimiz verileri elde ederek gerekli sutuna ortalama işlemlerini gerçekleştirdim.
df_titanic.query("Survived==0 and Sex=='female'").Age.mean()

27.915708812260537

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [82]:
df_titanic = pd.read_csv(f"{file_name}.csv")

In [83]:
 #Kurtulanların indislerini degişkene attım
selection=df_titanic.Survived==1 
 #degişkenimdeki indisleri dataya vererek istediğim verileri alarak yaş sütünün ortalamasını buldum.
df_titanic[selection].Age.mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [84]:
#kurtulan kişilerin indisleri elimdeydi ücret sütünunun ortalamasını buldum.
df_titanic[selection].Fare.mean() #ortalama

48.39540760233918

Kazadan kurtulan toplam kişi sayısını bulunuz

In [86]:
#kurtulan kişilerin indisleri elimdeydi len komutuyla kaç kişi olduğunu buldum.
len(df_titanic[selection].Fare)

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [87]:
#sorgulama yaparak da indisleri bulup istediğimiz verileri elde ederek gerekli sutuna ortalama işlemlerini gerçekleştirdim.
df_titanic.query("Survived==1 and Sex=='male'").Age.mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [88]:
#sorgulama yaparak da indisleri bulup istediğimiz verileri elde ederek gerekli sutuna ortalama işlemlerini gerçekleştirdim.
df_titanic.query("Survived==0 and Sex=='female'").Age.mean()

25.046875

# Soru 3:

In [ ]:
df_titanic = pd.read_csv(f"{file_name}.csv")

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [188]:
#10 yaşından küçük verileri buluyorum ve indeklerini selectiona atıyorum
selection=df_titanic.Age<10
#10 yaşından küçük kişilerin bilet ücreti ortalamaları
df_titanic[selection].Fare.median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [187]:
#10 yaşından büyük verileri buluyorum ve indeklerini selectiona atıyorum
selection=df_titanic.Age>10
#10 yaşından büyük kişilerin bilet ücreti ortalamaları
df_titanic[selection].Fare.median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

# 1.Sınıf yolcular için işlemler

In [139]:
#1.sınıf bilet almış kişiler(yorulmarken işe yarıyabilir)
len(df_titanic.query("Pclass==1"))

216

In [141]:
#1.sınıf bilet almış ve ölmüş kişiler(yorulmarken işe yarıyabilir)
len(df_titanic.query("Survived==0 and Pclass==1"))

80

In [131]:
#1.sınıf bilet alan ve ölmüş kişilerin 1.sınıf bilet almış ve hayatta kalmış kişilere oranı ölüm oranını vermiş olur.
len(df_titanic.query("Survived==0 and Pclass==1"))/len(df_titanic.query("Pclass==1"))

0.37037037037037035

# 2.Sınıf yolcular için işlemler

In [145]:
#2.sınıf bilet almış kişiler(yorulmarken işe yarıyabilir)
len(df_titanic.query("Pclass==2"))

184

In [148]:
#2.sınıf bilet almış ve ölmüş kişiler(yorulmarken işe yarıyabilir)
len(df_titanic.query("Survived==0 and Pclass==2"))

97

In [147]:
#2.sınıf bilet alan ve ölmüş kişilerin 2.sınıf bilet almış ve hayatta kalmış kişilere oranı ölüm oranını vermiş olur.
len(df_titanic.query("Survived==0 and Pclass==2"))/len(df_titanic.query("Pclass==2"))

0.5271739130434783

# 3.Sınıf yolcular için işlemler

In [150]:
#3.sınıf bilet almış kişiler(yorulmarken işe yarıyabilir)
len(df_titanic.query("Pclass==3"))

491

In [151]:
#3.sınıf bilet almış ve ölmüş kişiler(yorulmarken işe yarıyabilir)
len(df_titanic.query("Survived==0 and Pclass==3"))

372

In [153]:
#3.sınıf bilet alan ve ölmüş kişilerin 3.sınıf bilet almış ve hayatta kalmış kişilere oranı ölüm oranını vermiş olur.
uc_olum_oran=len(df_titanic.query("Survived==0 and Pclass==3"))/len(df_titanic.query("Pclass==3"))
uc_olum_oran

0.7576374745417516

# Yorumlama

In [159]:
print("1.sınıf için ölüm oranı:0.37  2.sınıf için ölüm oranı:0.52  3.sınıf ölüm oranı:0.75 sınıf arttıkça görüldüğü gibi ölme oranıda düşmektedir.")

1.sınıf için ölüm oranı:0.37  2.sınıf için ölüm oranı:0.52  3.sınıf ölüm oranı:0.75 sınıf arttıkça görüldüğü gibi ölme oranıda düşmektedir

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [161]:
df_titanic.query("Pclass==1").Fare.mean()

84.1546875

In [163]:
df_titanic.query("Pclass==2").Fare.mean()

20.662183152173913

In [165]:
df_titanic.query("Pclass==3").Fare.mean()

13.675550101832993

In [ ]:
# Bilet fiyatları sınıflar arttıkça artmaktadır.  P3fare<P2fare<P1fare

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [168]:
#kadın sayısı
len(df_titanic.query("Sex=='female'"))

314

In [170]:
#erkek sayısı
len(df_titanic.query("Sex=='male'"))

577

In [171]:
#kadınların ölüme oranı
len(df_titanic.query("Sex=='female' and Survived==0"))/len(df_titanic.query("Sex=='female'"))

0.25796178343949044

In [172]:
#erkeklerin ölme oranı
len(df_titanic.query("Sex=='male' and Survived==0"))/len(df_titanic.query("Sex=='male'"))

0.8110918544194108

In [173]:
#hayatta kalanlara göre yorumladım :)*/
print("Kadınlar erkeklere göre daha çok hayatta kalmışlar bunun sebebi de büyük bir ihtimalle ilk önce kadınları kurtardıklarından dolayıdır.")

Kadınlar erkeklere göre daha çok hayatta kalmışlar bunun sebebi de büyük bir ihtimalle ilk önce kadınları kurtardıklarından dolayıdır.

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [176]:
#kazada ölmüş erkeklerin bilet ortalama fiyatları
df_titanic.query("Sex=='male' and Survived==0").Fare.mean()

21.96099294871795

In [178]:
#Kazadan kurtulmuş erkeklerin bilet ortalama fiyatları
df_titanic.query("Sex=='male' and Survived==1").Fare.mean()

40.82148440366972

In [179]:
print("Kazada kurtulan erkekler büyük ihtimalle üst sınıf bilet almış kişiler.")

Kazada kurtulan erkekler büyük ihtimalle üst sınıf bilet almış kişiler.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

# Soru 8

In [69]:
file_name = "train_missing"
df_titanic_missing = pd.read_csv(f"{file_name}.csv")

In [213]:
display(df_titanic_missing)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [184]:
df_titanic_missing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        721 non-null    float64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         800 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     718 non-null    object
dtypes: float64(3), int64(4), object(5)
memory usage: 83.7+ KB

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

# Yaş işlemleri

In [190]:
#datamızda yaş değişkeninde kaç tane missing value oldugunu buldum.
df_titanic_missing.Age.isnull().sum()

177

In [205]:
#yaş degişkenimin ortalaması
df_titanic_missing.Age.mean()

29.69911764705882

In [192]:
#datamdaki yaş degişkeninde missing valueları datamda ki yaş degişkenimin ortalaması ile doldurdum.
df_titanic_missing.Age=df_titanic_missing.Age.fillna(value=df_titanic_missing.Age.mean())

In [194]:
# yaptığım işlemler sonucunda missing value kalmışmı diye baktım.
df_titanic_missing.Age.isnull().sum()

0

# Gemiye nereden binmiş işlemleri

In [196]:
#datamızda Embarked değişkeninde kaç tane missing value oldugunu buldum.
df_titanic_missing.Embarked.isnull().sum()

173

In [203]:
#Embarked degişkenimin en çok tekrar eden valuesu
df_titanic_missing.Embarked.mode()[0]

'S'

In [201]:
#datamdaki Embarked degişkeninde missing valueları datamda ki Embarked degişkenimin en çok tekrar eden valuesu ile doldurdum.
df_titanic_missing.Embarked = df_titanic_missing.Embarked.fillna(df_titanic_missing.Embarked.mode()[0])

In [204]:
# yaptığım işlemler sonucunda missing value kalmışmı diye baktım.
df_titanic_missing.Embarked.isnull().sum()

0

# Bilet ücreti işlemleri

In [207]:
#datamızda Fare değişkeninde kaç tane missing value oldugunu buldum.
df_titanic_missing.Fare.isnull().sum()

91

In [209]:
#ücret degişkenimin ortalaması
df_titanic_missing.Fare.mean()

31.844821875

In [212]:
#datamdaki ücret degişkeninde missing valueları datamda ki ücret degişkenimin ortalaması ile doldurdum.
df_titanic_missing.Fare=df_titanic_missing.Fare.fillna(value=df_titanic_missing.Fare.mean())

In [213]:
# yaptığım işlemler sonucunda missing value kalmışmı diye baktım.
df_titanic_missing.Fare.isnull().sum()

0

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

*Yöntem*:Kullanacağım  yöntem  insanların  soy isimlerine  bakarak aynı soyisimde kaç kişi olduğunu bulup  bunu kardeş eş sayısı olarak belirtmek olur.

In [70]:
file_name = "train_missing"
df_titanic_missing = pd.read_csv(f"{file_name}.csv")
df_titanic_missing

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [71]:
#yeni bir dataFrame oluşturup virgüle kadar olan kısmı split ettiğim bana  soy ismi verdi ve datama attım.
new = df_titanic_missing["Name"].str.split(",",n=1,expand = True)
#df_titanic_missing datamda name satırının yanına aldığım soy isimleri ekledim.
df_titanic_missing.insert(4,"Last_name",new[0])

In [72]:
df_titanic_missing

,PassengerId,Survived,Pclass,Name,Last_name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",Heikkinen,female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",Allen,male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",Montvila,male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",Graham,female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",Johnston,female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",Behr,male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",Dooley,male,32.0,0.0,0,370376,7.7500,NaN,Q

In [73]:
#SibSp satırımda Null olan değerlerin indislerini buldum.
selector=df_titanic_missing.SibSp.isnull()
# bulduğum değerleri görüntülemek için yazdım.
df_titanic_missing[selector]

,PassengerId,Survived,Pclass,Name,Last_name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",Palsson,male,2.0,NaN,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",Johnson,female,27.0,NaN,2,347742,11.1333,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",Vestrom,female,14.0,NaN,0,350406,7.8542,NaN,NaN
22,23,1,3,"McGowan, Miss. Anna ""Annie""",McGowan,female,15.0,NaN,0,330923,8.0292,NaN,Q
30,31,0,1,"Uruchurtu, Don. Manuel E",Uruchurtu,male,40.0,NaN,0,PC 17601,27.7208,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
854,855,0,2,"Carter, Mrs. Ernest Courtenay (Lilian Hughes)",Carter,female,44.0,NaN,0,244252,26.0000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",Swift,female,48.0,NaN,0,17466,25.9292,D17,S
878,879,0,3,"Laleff, Mr. Kristo",Laleff,male,NaN,NaN,0,349217,7.8958,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",Potter,female,56.0,NaN,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",Markun,male,33.0,NaN,0,349257,7.8958,NaN,S

In [74]:
for i,col in df_titanic_missing[selector].iterrows():
    print(col.Last_name,i)

Palsson 7
Johnson 8
Vestrom 14
McGowan 22
Uruchurtu 30
Mamee 36
Cann 37
Turpin 41
Devaney 44
Lennon 46
Nosworthy 51
Icard 61
Andersson 68
Kink 69
McDermott 82
Carrau 83
Ford 86
Slocovski 87
Celotti 89
Salkjelsvik 106
Porter 110
Barton 112
Connors 116
Turpin 117
Baxter 118
Webber 123
White 124
Coelho 131
Robins 132
Futrelle 137
Giglio 139
Nysten 141
Burke 143
Nicholls 145
van Billiard 153
Olsen 154
Williams 155
Bengtsson 162
Lefebre 176
Hale 178
Pernot 181
Becker 183
Turcin 189
Carbines 191
Yrois 199
Vande Walle 200
Cohen 204
Backstrom 206
Albimona 207
Blank 209
Ali 210
Mellors 226
Zabour 240
Attalah 244
Hamalainen 247
Beckwith 248
Stead 252
Graham 268
Bissette 269
Healy 274
Andrews 275
Lindblom 276
Dorking 283
McCoy 301
Francatelli 309
Nilsson 315
Slayter 322
Burns 337
Navratil 340
Collander 342
Bowerman 356
Moussa 367
Aubart 369
Beavan 372
Palsson 374
Meyer 375
Landergren 376
Widener 377
Tikkanen 382
Newell 393
Pain 398
Widegren 406
Cunningham 413
Danbom 423
Toomey 458
Gee 462
Goncalves 465
Scanlan 468
Baclini 469
Renouf 476
Goodwin 480
Turkula 483
Hagland 490
Molson 492
Stanley 494
O'Sullivan 502
Quick 506
Lang 509
Daly 510
Ryan 517
Vovk 521
Lahoud 522
Beane 546
Morrow 560
Simmons 563
Stoytcheff 566
Appleton 571
Patchett 575
Thayer 581
Downton 582
Chapman 594
Harrington 602
Torber 603
Laroche 608
Andersson 610
Horgan 613
Brocklebank 614
Nakid 622
Stahelin-Maeglin 632
Thorneycroft 639
Sagesser 641
Harper 645
Hickman 655
Radeff 656
Colley 662
Davidson 671
Mitchell 672
Watson 674
Olsvigen 682
Goodwin 683
Fischer 688
Dick 690
Mullens 697
Klaber 711
Taylor 712
Greenberg 714
Endres 716
Harper 720
Jensen 721
Renouf 726
Knight 732
Troupiansky 734
Williams 735
Ryerson 742
Stranden 744
Marvin 748
Vande Velde 752
Hogeboom 765
Brewe 766
Mangan 767
Lievens 770
Myhrman 775
Tobin 776
Dean 788
Keane 790
Hoyt 793
Johansson 805
Chambers 809
Fry 815
Mallet 817
Mallet 827
Alhomaki 840
Mudd 841
Goldenberg 849
Andersson 850
Carter 854
Swift 862
Laleff 878
Potter 879
Markun 881

In [75]:
len(df_titanic_missing.loc[1].Last_name)

7

In [80]:
for i,col in df_titanic_missing[selector].iterrows():
    temp=df_titanic_missing.Last_name==df_titanic_missing.loc[i].Last_name
    print(len(df_titanic_missing[temp]))

4
6
1
1
1
1
1
2
1
1
1
1
9
1
1
1
4
1
1
1
1
1
1
2
2
2
2
1
1
2
1
1
1
1
1
3
4
1
4
1
1
2
1
1
1
1
1
2
1
1
2
1
2
2
2
2
1
3
1
1
2
1
1
2
1
1
1
1
3
1
1
1
1
1
4
3
1
1
1
3
1
1
1
2
1
1
1
1
4
2
6
1
2
1
2
1
2
1
2
1
1
1
2
1
1
1
1
1
3
1
2
1
1
3
9
1
1
2
1
2
1
4
3
1
1
1
1
1
1
6
1
2
1
1
2
1
1
4
3
2
1
1
4
2
1
1
1
1
1
1
1
1
1
2
2
3
3
2
1
2
2
1
1
2
9
6
1
1
1
1

In [77]:
#Burada SibSp nin null olan değerlerim üzerinde dönüp o satırda ki soy isimin kaç tane olduğunu bulup kendisini çıkarıp SibSp satırına ekledim.
for i,col in df_titanic_missing[selector].iterrows():
    temp=df_titanic_missing.Last_name==col.Last_name      
    if(len(df_titanic_missing[temp])>1 ):
        df_titanic_missing.loc[i,"SibSp"]=len(df_titanic_missing[temp])-1
    elif(len(df_titanic_missing[temp])==1):
        df_titanic_missing.loc[i,"SibSp"]=0

In [78]:
df_titanic_missing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Last_name    891 non-null    object
 5   Sex          891 non-null    object
 6   Age          714 non-null    float64
 7   SibSp        891 non-null    float64
 8   Parch        891 non-null    int64
 9   Ticket       891 non-null    object
 10  Fare         800 non-null    float64
 11  Cabin        204 non-null    object
 12  Embarked     718 non-null    object
dtypes: float64(3), int64(4), object(6)
memory usage: 90.6+ KB

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [63]:
file_name = "train_missing"
df_titanic_missing = pd.read_csv(f"{file_name}.csv")

In [64]:
#embarked_NAN sütünunu oluşturup NAN degişken atadım.
df_titanic_missing.insert(12,"Embarked_NAN","NAN")

In [65]:
df_titanic_missing

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_NAN
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S,NAN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C,NAN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S,NAN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN,NAN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S,NAN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S,NAN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S,NAN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN,NAN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q,NAN

In [66]:
#Embarked degiştirebilmiş miyim diye NAN degişkeni sayısına baktım.
df_titanic_missing.Embarked_NAN.value_counts()

NAN    891
Name: Embarked_NAN, dtype: int64

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [237]:
#Ücretlerin orta değeri
df_titanic_missing.Fare.median()

14.45625

In [239]:
#Fare_missing değişkenini 10.sütüna yerleştirdim, ismini verdim ve valuesu için median kullandım.
df_titanic_missing.insert(10,"Fare_Missing",df_titanic_missing.Fare.median())

ValueError: cannot insert Fare_Missing, already exists

In [240]:
#datam değişti mi diye görüntüledim.
df_titanic_missing

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,14.45625,NaN,NAN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,14.45625,C85,NAN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,14.45625,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,14.45625,C123,NAN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,14.45625,NaN,NAN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,14.45625,NaN,NAN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,14.45625,B42,NAN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,14.45625,NaN,NAN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,14.45625,C148,NAN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,14.45625,NaN,NAN